# Part 1
I put together an ERD using MySQL Workbench for the data file given. I decided to split the data into a table for:
* users
* favorites
* books
* authors

![png](model_erd.png)

# Part 2
Part 2 consists of using python to create a database in our localhost with the provided tables

## Importing Libraries

In [7]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
users = pd.read_csv('https://docs.google.com/spreadsheets/d/1_c2WTx_eiH8pUM-PTgyt7T4aIl1A3Cp1ukPVPEijoYc/gviz/tq?tqx=out:csv&sheet=users')
users

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [3]:
books = pd.read_csv('https://docs.google.com/spreadsheets/d/1_D-vW7GXiQfG6D9nzjscgVctKLb6TZl_o8ERNH_tet8/gviz/tq?tqx=out:csv&sheet=books')
books

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4
5   6          Frankenstein          5

In [5]:
authors = pd.read_csv('https://docs.google.com/spreadsheets/d/17rABPt5eaIxfhGO75dYCbH-5IloKsAR0HH9V6VC43ZI/gviz/tq?tqx=out:csv&sheet=authors')
authors

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [6]:
favorites = pd.read_csv('https://docs.google.com/spreadsheets/d/1SLb3RAhcrZsPWRwR0_njWX7KssUYZ16JFsVqBkSU2GI/gviz/tq?tqx=out:csv&sheet=favorite')
favorites

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5
5        3        5
6        3        6

These tables are very close to the ERD I made. Lets create the tables in the database

## Connection String and creating the database in my localhost

In [8]:
connection_string = 'mysql+pymysql://root:root@localhost/books'
engine = create_engine(connection_string)

In [9]:
if database_exists(connection_string) == False:
    create_database(connection_string)
else:
    print('DB already exists')

## Adding the tables to MySQL

In [10]:
books.to_sql('books', engine, if_exists = 'replace')
favorites.to_sql('favorites', engine, if_exists = 'replace')
authors.to_sql('authors', engine, if_exists = 'replace')
users.to_sql('users', engine, if_exists = 'replace')

3

Showing the tables

In [11]:
q = '''SHOW TABLES'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [12]:
q2 = '''SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));'''

pd.read_sql(q2, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1